package main
import (
	"fmt"
)

func main(){

	//创建方式一
	//声明一个Map
	var map1 map[int]string
	//当一个Map声明的时候 是没有分配空间的 需要进行make函数给其分隔空间才能使用
	map1 = make(map[int]string,10)//make(类型，长度)
	map1[20190415] = "张三"
	map1[20190416] = "李四"
	map1[20190407] = "王五"
	fmt.Println(map1)//map[20190407:王五 20190415:张三 20190416:李四]
	//map键值对排序是根据键的值从小到大排列的
	map1[20190416] = "赵六"
	map1[20190417] = "赵六"
	fmt.Println(map1) //map[20190407:王五 20190415:张三 20190416:赵六 20190417:赵六]
	//当键 key 重复的时候 原value会被新的value覆盖 key 不能重复 value可以

	//创建方式二
	map2 := make(map[int]string)
	map2[20190415] = "张三"
	map2[20190416] = "李四"
	map2[20190407] = "王五"
	fmt.Println(map2)//map[20190407:王五 20190415:张三 20190416:李四]
	//创建方式三
	map3 := map[int]string{
		20190415:"张三",
		20190416:"李四",
		20190407:"王五",//每个键值对一定要用逗号结尾 就算是最后一个也要逗号结尾
	}
	map3[20190409] = "赵六"
	fmt.Println(map3)//map[20190407:王五 20190409:赵六 20190415:张三 20190416:李四]
}